code-review/NRB_3471_3546/База_Стало/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Comment>На начало(0), На конец операционного дня(1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Выписка/Forms/ФормаДокумента/Ext/Form/Module.bsl
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Отказ = ?(Объект.Проверка, Истина, Отказ);
	 
	 Если Объект.Ссылка.Пустая() Тогда 
		  
		УстановитьНомерДокументаСервер();
		ЗаполнитьШапкуДокументаСервер();
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ВидОтчета) Тогда
		Объект.ВидОтчета = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО;
	КонецЕсли;
	
	ДоступностьСтраниц(ЭтаФорма);
	ОпределитьДоступныеОтчеты(ЭтаФорма);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьНомерДокументаСервер();

КонецПроцедуры


&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	ДоступностьСтраниц(ЭтаФорма);	
    ОпределитьДоступныеОтчеты(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ВладелецСчетаПриИзменении(Элемент)
	ДоступныеТипы = Новый Массив;
	Если ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепо"));
	ИначеЕсли ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепоМХ"));
	КонецЕсли;
	Элементы.СчетДепо.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
КонецПроцедуры

//#КонецОбласти


//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтаФорма);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Объект.ДатаНачПериода ;
	Диалог.Период.ДатаОкончания = Объект.ДатаКонПериода; 
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыпискаПоСчетуДепо(Команда)
	
	ФормированиеВыпискиОСостоянииСчетаДЕПО();

КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОперации(Команда)
	
	ФормированиеВыпискиОбОперацияхПоСчетуДЕПО();

КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
	
	ФормированиеОтчетаОВыполненнойОперации();

КонецПроцедуры

&НаКлиенте
Процедура СводныйОтчетОСовершеннойОперации(Команда)
	
	ФормированиеСводногоОтчетаОСовершеннойОперации();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФормированиеОтчетаОВыполненнойОперации(Знач ПроверятьИсходящийНомер = Ложь) Экспорт
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(Объект.ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.ОперацияЦБ) Тогда
		//Форма	= Отчеты.ОтчетОВыполненнойОперации_Новый.ПолучитьФорму("Форма");
		Форма = ПолучитьФорму("Отчет.ОтчетОВыполненнойОперации_Новый.Форма.ФормаОтчета");
		Форма.Отчет.Основание		= Объект.Ссылка;
		Форма.Отчет.ОперацияЦБ	= Объект.ОперацияЦБ;
		Форма.Отчет.ДатаВыписки	= Объект.Дата;
		Форма.Открыть();
		Форма.Отчет.ТипОперации	= ПолучитьИмя(Объект.ОперацияЦБ);
		Форма.ЗаполнитьОтчет();
	Иначе
		Сообщить("Не определена 'Операция ЦБ'!!!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмя(ОперацияЦБ)
	
	Возврат ОперацияЦБ.Метаданные().Имя;
КонецФункции

&НаКлиенте
Процедура ФормированиеВыпискиОбОперацияхПоСчетуДЕПО(Знач ПроверятьИсходящийНомер = Ложь)
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(Объект.ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПравоФормироватьВыписку() Тогда
		
		Форма = ПолучитьФорму("Отчет.ВыпискаОбОперацияхСчетамДепо_Новая.Форма.ФормаОтчета");
		//---
		Форма.Элементы.ФормаНастройкиФормированияВыписок.Пометка	= Истина;
		Форма.Отчет.ВыпискаДокумент									= Объект.Ссылка;
		Форма.Отчет.Выписка											= Истина;
		
		Форма.Открыть();
		
		Форма.ВыпискаДокументПриИзменении();
		
		Форма.Сформировать();
		
	Иначе
		
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФормированиеСводногоОтчетаОСовершеннойОперации(Знач ПроверятьИсходящийНомер = Ложь)
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(Объект.ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Форма = ПолучитьФорму("Обработка.ФормированиеОтчетовОСовершенныхОперациях.Форма.Форма");
	Попытка
		Форма.Объект.ИнформационнаяВыписка = Объект.Ссылка;
	Исключение
		Возврат;
	КонецПопытки;
	
	ФильтрОперацииПоВыписке = ФильтрОперацииПоВыпискеНаСервере(Объект.Ссылка);
	Форма.Объект.ДокументОперацииСводногоОтчета  = ФильтрОперацииПоВыписке.ДокументОперацииСводногоОтчета;
	Форма.Объект.ДатаОпераций					 = ФильтрОперацииПоВыписке.ДатаОпераций;
	Форма.Объект.ДатаФормированияОтчетов		 = Объект.Дата;
	
	Форма.Открыть();
	Форма.СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ФильтрОперацииПоВыпискеНаСервере(Выписка)
	ДокументОперацииСводногоОтчета = Обработки.ФормированиеОтчетовОСовершенныхОперациях.ОперацияПоВыписке(Выписка);
	ДатаОпераций = ДокументОперацииСводногоОтчета.Дата;
	Результат = Новый Структура("ДокументОперацииСводногоОтчета, ДатаОпераций", ДокументОперацииСводногоОтчета, ДатаОпераций);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ФормированиеВыпискиОСостоянииСчетаДЕПО(Знач ПроверятьИсходящийНомер = Ложь)
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(Объект.ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЕстьПравоФормироватьВыписку() Тогда
		ПараметрыОтчета = Новый Структура("Выписка", Объект.Ссылка);
		ОткрытьФорму("Отчет.ВыпискаОСостоянииСчетаДепо.Форма.ФормаОтчета", ПараметрыОтчета);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЕстьПравоФормироватьВыписку()
	
	Если Не Справочники.Контрагенты.ОсобыеУсловия(Объект.ВладелецСчета)
		Или РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда 
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + Объект.ВладелецСчета
		+ ". Выполнение операции доступно Ответственному за особых клиентов");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОпределитьДоступныеОтчеты(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
		
	Если Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО") Тогда
		Элементы.ФормаВыпискаПоСчетуДепо.Доступность	= Истина;
		Элементы.ФормаВыпискаОперации.Доступность		= Ложь;
		Элементы.ФормаОтчет.Доступность				= Ложь;
		Элементы.ФормаСводныйОтчетОСовершеннойОперации.Доступность	= Ложь;
	ИначеЕсли Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО") Или Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.Выписка") Тогда
		Элементы.ФормаВыпискаПоСчетуДепо.Доступность	= Ложь;
		Элементы.ФормаВыпискаОперации.Доступность		= Истина;
		Элементы.ФормаОтчет.Доступность				= Ложь;
		Элементы.ФормаСводныйОтчетОСовершеннойОперации.Доступность	= Ложь;
	ИначеЕсли Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.СводныйОтчетОСовершеннойОперации") Тогда
		Элементы.ФормаВыпискаПоСчетуДепо.Доступность				= Ложь;
		Элементы.ФормаВыпискаОперации.Доступность					= Ложь;
		Элементы.ФормаОтчет.Доступность								= Ложь;
		Элементы.ФормаСводныйОтчетОСовершеннойОперации.Доступность	= Истина;
	Иначе
		Элементы.ФормаВыпискаПоСчетуДепо.Доступность	= Ложь;
		Элементы.ФормаВыпискаОперации.Доступность		= Ложь;
		Элементы.ФормаОтчет.Доступность				= Истина;
		Элементы.ФормаСводныйОтчетОСовершеннойОперации.Доступность	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		Объект.ДатаНачПериода = Период.ДатаНачала;
		Объект.ДатаКонПериода = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДоступностьСтраниц(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Если Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.Отчет")  Тогда
		ВидимаяСтраница   = Элементы.Отчет;
		НеВидимаяСтарница1 = Элементы.Выписка;		
		НеВидимаяСтарница2 = Элементы.ВыпискаОСостоянииСчета;		
	ИначеЕсли Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.Выписка")  Тогда
		ВидимаяСтраница   = Элементы.Выписка;
		НеВидимаяСтарница1 = Элементы.Отчет;		
		НеВидимаяСтарница2 = Элементы.ВыпискаОСостоянииСчета;		
	ИначеЕсли Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО")  Тогда
		ВидимаяСтраница   = Элементы.Выписка;
		НеВидимаяСтарница1 = Элементы.Отчет;		
		НеВидимаяСтарница2 = Элементы.ВыпискаОСостоянииСчета;		
	ИначеЕсли Объект.ВидОтчета = ПредопределенноеЗначение("Перечисление.ВидыОтчетов.СводныйОтчетОСовершеннойОперации")  Тогда
		ВидимаяСтраница   = Элементы.Выписка;
		НеВидимаяСтарница1 = Элементы.Отчет;		
		НеВидимаяСтарница2 = Элементы.ВыпискаОСостоянииСчета;		
	Иначе
		ВидимаяСтраница   = Элементы.ВыпискаОСостоянииСчета;;
		НеВидимаяСтарница1 = Элементы.Отчет;		
		НеВидимаяСтарница2 = Элементы.Выписка;		
	КонецЕсли; 
	
	ВидимаяСтраница.Видимость    = Истина;
	НеВидимаяСтарница1.Видимость  = Ложь;
	НеВидимаяСтарница2.Видимость  = Ложь;
	Элементы.Страницы.ТекущаяСтраница = ВидимаяСтраница;

КонецПроцедуры

//#КонецОбласти
